Autodesk.Revit.DB.Events.RevitAPIPostEventArgs.Status
Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
Since:
2011

Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
The class is used as a base class for arguments of any post-event.
Remarks:
A post-event is the event raised after execution of the process that was related with the event.
Since:
2011